In [ ]:
pip install tensorflow

In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name" : ["harry","rohan","skiilf"],
    "marks" : [10,20,30],
    "city": ["chandigarh","mohali","panchkula"]
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  marks        city
0   harry     10  chandigarh
1   rohan     20      mohali
2  skiilf     30   panchkula

In [5]:
df.to_csv("demo.csv")

In [6]:
df.to_csv("demo_indexFalse.csv",index="False")

In [7]:
df.head(1)

    name  marks        city
0  harry     10  chandigarh

In [8]:
df.tail(1)

     name  marks       city
2  skiilf     30  panchkula

In [9]:
df.describe()

       marks
count    3.0
mean    20.0
std     10.0
min     10.0
25%     15.0
50%     20.0
75%     25.0
max     30.0

In [10]:
df["name"][0] = "ak"

C:\Users\Akhil Semwal\AppData\Local\Temp\ipykernel_11540\2116100437.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df["name"][0] = "ak"
C:\Users\Akhil Semwal\AppData\Local\Temp\ipykernel_11540\2116100437.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["name"][0] = "ak"

In [11]:
df.to_csv("demo.csv")

In [12]:
df.index = ["First","Second","Third"]

In [13]:
df

          name  marks        city
First       ak     10  chandigarh
Second   rohan     20      mohali
Third   skiilf     30   panchkula

In [18]:
ser = pd.Series(np.random.rand(10))
ser

0    0.963007
1    0.965339
2    0.645873
3    0.587623
4    0.602499
5    0.563698
6    0.871415
7    0.290441
8    0.116053
9    0.976095
dtype: float64

In [19]:
type(ser)

pandas.core.series.Series

In [20]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [21]:
newdf

            0         1         2         3         4
0    0.083314  0.598852  0.800274  0.668023  0.724487
1    0.063307  0.424135  0.686217  0.119010  0.229442
2    0.352935  0.348773  0.797117  0.422154  0.683273
3    0.832451  0.072771  0.925110  0.220157  0.251020
4    0.284702  0.999534  0.067535  0.995277  0.931784
..        ...       ...       ...       ...       ...
329  0.214286  0.858021  0.204525  0.720654  0.474984
330  0.676299  0.475858  0.367834  0.375334  0.481006
331  0.944545  0.048163  0.782455  0.603063  0.439551
332  0.407472  0.801025  0.984330  0.430883  0.419618
333  0.770725  0.167477  0.534903  0.092460  0.219865

[334 rows x 5 columns]

In [22]:
newdf.to_numpy()

array([[0.08331414, 0.59885215, 0.80027412, 0.66802278, 0.72448744],
       [0.0633072 , 0.42413465, 0.68621731, 0.11901042, 0.22944223],
       [0.35293536, 0.34877348, 0.7971168 , 0.42215422, 0.68327312],
       ...,
       [0.94454522, 0.04816261, 0.78245463, 0.60306338, 0.43955135],
       [0.40747249, 0.80102511, 0.98433   , 0.43088281, 0.41961771],
       [0.77072474, 0.16747724, 0.53490325, 0.09245963, 0.21986481]])

In [23]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.083314,0.063307,0.352935,0.832451,0.284702,0.663614,0.657419,0.351212,0.208149,0.087245,...,0.069488,0.320920,0.128292,0.494071,0.710097,0.214286,0.676299,0.944545,0.407472,0.770725
1,0.598852,0.424135,0.348773,0.072771,0.999534,0.487632,0.187843,0.651549,0.844212,0.756022,...,0.817815,0.079281,0.701772,0.575256,0.251171,0.858021,0.475858,0.048163,0.801025,0.167477
2,0.800274,0.686217,0.797117,0.925110,0.067535,0.529407,0.062640,0.478557,0.899102,0.333214,...,0.196998,0.163999,0.345209,0.716028,0.372124,0.204525,0.367834,0.782455,0.984330,0.534903
3,0.668023,0.119010,0.422154,0.220157,0.995277,0.702679,0.432711,0.850062,0.930557,0.838613,...,0.159405,0.486650,0.371704,0.106767,0.936674,0.720654,0.375334,0.603063,0.430883,0.092460
4,0.724487,0.229442,0.683273,0.251020,0.931784,0.132241,0.019159,0.374739,0.283199,0.653106,...,0.289681,0.742656,0.694462,0.906234,0.332867,0.474984,0.481006,0.439551,0.419618,0.219865

In [24]:
newdf[0]

0      0.083314
1      0.063307
2      0.352935
3      0.832451
4      0.284702
         ...
329    0.214286
330    0.676299
331    0.944545
332    0.407472
333    0.770725
Name: 0, Length: 334, dtype: float64